STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231fxx_ca35.h
/**********  Bit definition for ETH_MMC_TX_INTERRUPT_MASK register  ***********/
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_Pos                         (0U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_Pos)                        /*!< 0x00000001 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM                             ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_Msk                                  /*!< MMC Transmit Good Bad Octet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_Pos                         (1U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_Pos)                        /*!< 0x00000002 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM                             ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_Msk                                  /*!< MMC Transmit Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_Pos                          (2U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_Msk                          (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_Pos)                         /*!< 0x00000004 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM                              ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_Msk                                   /*!< MMC Transmit Broadcast Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_Pos                          (3U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_Msk                          (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_Pos)                         /*!< 0x00000008 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM                              ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_Msk                                   /*!< MMC Transmit Multicast Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_Pos                      (4U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_Msk                      (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_Pos)                     /*!< 0x00000010 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM                          ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_Msk                               /*!< MMC Transmit 64 Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_Pos                  (5U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_Msk                  (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_Pos)                 /*!< 0x00000020 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM                      ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_Msk                           /*!< MMC Transmit 65 to 127 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_Pos                 (6U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_Msk                 (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_Pos)                /*!< 0x00000040 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM                     ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_Msk                          /*!< MMC Transmit 128 to 255 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_Pos                 (7U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_Msk                 (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_Pos)                /*!< 0x00000080 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM                     ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_Msk                          /*!< MMC Transmit 256 to 511 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_Pos                (8U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_Msk                (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_Pos)               /*!< 0x00000100 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM                    ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_Msk                         /*!< MMC Transmit 512 to 1023 Octet Good Bad Packet Counter */
#define ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_Pos                (9U)
#define ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_Msk                (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_Pos)               /*!< 0x00000200 */
#define ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM                    ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM_Msk                         /*!< MMC Transmit 1024 to Maximum Octet Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_Pos                         (10U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_Pos)                        /*!< 0x00000400 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM                             ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_Msk                                  /*!< MMC Transmit Unicast Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_Pos                         (11U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_Pos)                        /*!< 0x00000800 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM                             ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_Msk                                  /*!< MMC Transmit Multicast Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_Pos                         (12U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_Pos)                        /*!< 0x00001000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM                             ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_Msk                                  /*!< MMC Transmit Broadcast Good Bad Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_Pos                      (13U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_Msk                      (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_Pos)                     /*!< 0x00002000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM                          ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_Msk                               /*!< MMC Transmit Underflow Error Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Pos                        (14U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Pos)                       /*!< 0x00004000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_Msk                                 /*!< MMC Transmit Single Collision Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Pos                        (15U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Pos)                       /*!< 0x00008000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_Msk                                 /*!< MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_Pos                          (16U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_Msk                          (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_Pos)                         /*!< 0x00010000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM                              ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_Msk                                   /*!< MMC Transmit Deferred Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_Pos                       (17U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_Msk                       (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_Pos)                      /*!< 0x00020000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM                           ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_Msk                                /*!< MMC Transmit Late Collision Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_Pos                        (18U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_Pos)                       /*!< 0x00040000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_Msk                                 /*!< MMC Transmit Excessive Collision Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_Pos                        (19U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_Pos)                       /*!< 0x00080000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_Msk                                 /*!< MMC Transmit Carrier Error Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_Pos                          (20U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_Msk                          (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_Pos)                         /*!< 0x00100000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM                              ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_Msk                                   /*!< MMC Transmit Good Octet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Pos                          (21U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Msk                          (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Pos)                         /*!< 0x00200000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM                              ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_Msk                                   /*!< MMC Transmit Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_Pos                        (22U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_Pos)                       /*!< 0x00400000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_Msk                                 /*!< MMC Transmit Excessive Deferral Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_Pos                         (23U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_Msk                         (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_Pos)                        /*!< 0x00800000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM                             ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_Msk                                  /*!< MMC Transmit Pause Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_Pos                        (24U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_Pos)                       /*!< 0x01000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM                            ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_Msk                                 /*!< MMC Transmit VLAN Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_Pos                       (25U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_Msk                       (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_Pos)                      /*!< 0x02000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM                           ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_Msk                                /*!< MMC Transmit Oversize Good Packet Counter Interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Pos                        (26U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Pos)                       /*!< 0x04000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                            ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_Msk                                 /*!< MMC Transmit LPI microsecond counter interrupt Mask */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Pos                        (27U)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Msk                        (0x1UL << ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Pos)                       /*!< 0x08000000 */
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                            ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_Msk                                 /*!< MMC Transmit LPI transition counter interrupt Mask */

