STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp231fxx_ca35.h
/**************  Bit definition for SYSCFG_VDDIO2CCCR register  ***************/
#define SYSCFG_VDDIO2CCCR_RANSRC_Pos                                       (0U)
#define SYSCFG_VDDIO2CCCR_RANSRC_Msk                                       (0xFUL << SYSCFG_VDDIO2CCCR_RANSRC_Pos)                                         /*!< 0x0000000F */
#define SYSCFG_VDDIO2CCCR_RANSRC                                           SYSCFG_VDDIO2CCCR_RANSRC_Msk                                                   /*!< NMOS compensation code of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCCR_RAPSRC_Pos                                       (4U)
#define SYSCFG_VDDIO2CCCR_RAPSRC_Msk                                       (0xFUL << SYSCFG_VDDIO2CCCR_RAPSRC_Pos)                                         /*!< 0x000000F0 */
#define SYSCFG_VDDIO2CCCR_RAPSRC                                           SYSCFG_VDDIO2CCCR_RAPSRC_Msk                                                   /*!< PMOS compensation code of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCCR_EN_Pos                                           (8U)
#define SYSCFG_VDDIO2CCCR_EN_Msk                                           (0x1UL << SYSCFG_VDDIO2CCCR_EN_Pos)                                             /*!< 0x00000100 */
#define SYSCFG_VDDIO2CCCR_EN                                               SYSCFG_VDDIO2CCCR_EN_Msk                                                       /*!< VDDIO2 I/Os compensation cell enable */
#define SYSCFG_VDDIO2CCCR_CS_Pos                                           (9U)
#define SYSCFG_VDDIO2CCCR_CS_Msk                                           (0x1UL << SYSCFG_VDDIO2CCCR_CS_Pos)                                             /*!< 0x00000200 */
#define SYSCFG_VDDIO2CCCR_CS                                               SYSCFG_VDDIO2CCCR_CS_Msk                                                       /*!< VDDIO2 I/Os code selection */

/**************  Bit definition for SYSCFG_VDDIO2CCSR register  ***************/
#define SYSCFG_VDDIO2CCSR_ANSRC_Pos                                        (0U)
#define SYSCFG_VDDIO2CCSR_ANSRC_Msk                                        (0xFUL << SYSCFG_VDDIO2CCSR_ANSRC_Pos)                                          /*!< 0x0000000F */
#define SYSCFG_VDDIO2CCSR_ANSRC                                            SYSCFG_VDDIO2CCSR_ANSRC_Msk                                                    /*!< NMOS compensation value of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCSR_APSRC_Pos                                        (4U)
#define SYSCFG_VDDIO2CCSR_APSRC_Msk                                        (0xFUL << SYSCFG_VDDIO2CCSR_APSRC_Pos)                                          /*!< 0x000000F0 */
#define SYSCFG_VDDIO2CCSR_APSRC                                            SYSCFG_VDDIO2CCSR_APSRC_Msk                                                    /*!< PMOS compensation value of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCSR_READY_Pos                                        (8U)
#define SYSCFG_VDDIO2CCSR_READY_Msk                                        (0x1UL << SYSCFG_VDDIO2CCSR_READY_Pos)                                          /*!< 0x00000100 */
#define SYSCFG_VDDIO2CCSR_READY                                            SYSCFG_VDDIO2CCSR_READY_Msk                                                    /*!< VDDIO2 I/Os compensation cell ready flag */

/**************  Bit definition for SYSCFG_VDDIO1CCCR register  ***************/
#define SYSCFG_VDDIO1CCCR_RANSRC_Pos                                       (0U)
#define SYSCFG_VDDIO1CCCR_RANSRC_Msk                                       (0xFUL << SYSCFG_VDDIO1CCCR_RANSRC_Pos)                                         /*!< 0x0000000F */
#define SYSCFG_VDDIO1CCCR_RANSRC                                           SYSCFG_VDDIO1CCCR_RANSRC_Msk                                                   /*!< NMOS compensation code of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCCR_RAPSRC_Pos                                       (4U)
#define SYSCFG_VDDIO1CCCR_RAPSRC_Msk                                       (0xFUL << SYSCFG_VDDIO1CCCR_RAPSRC_Pos)                                         /*!< 0x000000F0 */
#define SYSCFG_VDDIO1CCCR_RAPSRC                                           SYSCFG_VDDIO1CCCR_RAPSRC_Msk                                                   /*!< PMOS compensation code of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCCR_EN_Pos                                           (8U)
#define SYSCFG_VDDIO1CCCR_EN_Msk                                           (0x1UL << SYSCFG_VDDIO1CCCR_EN_Pos)                                             /*!< 0x00000100 */
#define SYSCFG_VDDIO1CCCR_EN                                               SYSCFG_VDDIO1CCCR_EN_Msk                                                       /*!< VDDIO1 I/Os compensation cell enable */
#define SYSCFG_VDDIO1CCCR_CS_Pos                                           (9U)
#define SYSCFG_VDDIO1CCCR_CS_Msk                                           (0x1UL << SYSCFG_VDDIO1CCCR_CS_Pos)                                             /*!< 0x00000200 */
#define SYSCFG_VDDIO1CCCR_CS                                               SYSCFG_VDDIO1CCCR_CS_Msk                                                       /*!< VDDIO1 I/Os code selection */

/**************  Bit definition for SYSCFG_VDDIO1CCSR register  ***************/
#define SYSCFG_VDDIO1CCSR_ANSRC_Pos                                        (0U)
#define SYSCFG_VDDIO1CCSR_ANSRC_Msk                                        (0xFUL << SYSCFG_VDDIO1CCSR_ANSRC_Pos)                                          /*!< 0x0000000F */
#define SYSCFG_VDDIO1CCSR_ANSRC                                            SYSCFG_VDDIO1CCSR_ANSRC_Msk                                                    /*!< NMOS compensation value of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCSR_APSRC_Pos                                        (4U)
#define SYSCFG_VDDIO1CCSR_APSRC_Msk                                        (0xFUL << SYSCFG_VDDIO1CCSR_APSRC_Pos)                                          /*!< 0x000000F0 */
#define SYSCFG_VDDIO1CCSR_APSRC                                            SYSCFG_VDDIO1CCSR_APSRC_Msk                                                    /*!< PMOS compensation value of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCSR_READY_Pos                                        (8U)
#define SYSCFG_VDDIO1CCSR_READY_Msk                                        (0x1UL << SYSCFG_VDDIO1CCSR_READY_Pos)                                          /*!< 0x00000100 */
#define SYSCFG_VDDIO1CCSR_READY                                            SYSCFG_VDDIO1CCSR_READY_Msk                                                    /*!< VDDIO1 I/Os compensation cell ready flag */

